app/views/devise/registrations/edit.haml

SELECT "authentifications".* FROM "authentifications" WHERE "authentifications"."user_id" = 6
SELECT COUNT(*) FROM "authentifications" WHERE "authentifications"."user_id" = 8 AND "authentifications"."provider" = 'facebook'
---
      = f.label :password
      %i (leave blank if you don't want to change it
      %br/
      = f.password_field :password, :autocomplete => "off"

    %div
      = f.label :password_confirmation
      = f.password_field :password_confirmation

    %div
      = f.label :current_password
      %i (we need your current password to confirm your changes)
      = f.password_field :current_password

  %div= f.submit "Update"

- unless current_user.authentifications.empty?
  %h3 Social networks:
  - current_user.authentifications.each do |authentification|
    = image_tag "#{authentification.provider}.png", :title => authentification.provider
    = link_to 'Delete', authentification_path(authentification), :confirm => 'Are you sure?', :method => :delete
