app/controllers/authentifications_controller.rb

SELECT "authentifications".* FROM "authentifications" WHERE "authentifications"."user_id" = 6 AND "authentifications"."id" = $1 LIMIT 1  [["id", "6"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
DELETE FROM "authentifications" WHERE "authentifications"."id" = $1  [["id", 6]]
---
  def destroy
  	auth = Authentification.find(params[:id]) ; user = auth.user ; provider = auth.provider
    auth.destroy